styles = {'common_text_style': 'text-align: center; font-size: 26px;font-family: "CORBEL"; color: #45a049;',
          'mode_label_style': 'text-align: center; font-size: 20px;font-family: "CORBEL"; color: #45a049;'

          }
menu_pages_data = {1:
                       f"""
                     <p> <b>Привет! Добро пожаловать в игру 
                     "Дилемма заключенного"<b>
                     </p>
                     <p>
                         <b>Прочитайте внимательно инструкцию, выберите режим игры и
                          нажмите "Начать игру"<b>
                     </p>
                     <p>
                         <b>1. Вы выступаете в роли игрока 1. Игрок 2 скрыт от Вас за экраном компьютера, 
                         но он будет отвечать на Ваши действия.<b>
                     </p>
                     <p>
                         <b>2. Игра состоит из 2-х партий максимум по 25 минут.
                     </p>
                     <p>
                         <b>3. В качестве Игрока 2 могут выступать:<br><b>
                         <b>● игрок, которого выбирает компьютер;<br><b>
                         <b>● игроки с именами AA и BB, которых Вы можете выбрать самостоятельно.<b>
                     </p>
                     <p>
                        <b>4. По правилам игры, Вы можете выбрать один из 3-х вариантов:<br>
                           ● "Игра в 2-х партиях с один и тем же Игроком 2, которого выберет компьютер".<br>
                           ● "Играть вторую партию с игроком AA"<br>
                           ● "Играть вторую партию с игроком BB"
                     </p>
                     <p>
                        <b>Ход игры:<br>
                           У вас и Игрока 2 есть две кнопки на экране - "ноль" и "единица".<br>
                           Кнопки на экране появятся на экране после того как Вы будете готовы к началу игры - нажмете на кнопку "Начать игру" на экране.<br>
                           Вы начинаете каждый ход в игре. Для этого Вы должны принять решение и нажать выбранную кнопку "0" или "1".<br>
                           Игрок 2 ответит на ваше действие нажатием выбранной им одной из двух кнопок.
                     </p>
                     <p>
                        <b>Результат шага (выйгрыш на шаге!) в игре будет следующим:<br>
                        1. Если Вы и Игрок 2 нажали кнопку "1", то каждый получит по 100 рублей<br>
                        2. Если Вы и Игрок 2 нажали кнопку "0", то никто из вас не получает ничего.<br>
                        3. Если вы нажмете кнопку "0", а Игрок 2 - кнопку "1", то Вы получите 500 рублей, а Игрок 2 не получит ничего.<br>
                        4. Если Вы нажмете на кнопку "1", а Игрок 2 - кнопку "0", то игрок 2 получит 500 рублей, а Вы ничего не получите.
                     </p>
                     <p>
                        <b>Текущий результат - Ваш и Игрока 2 - в каждой игре Вы будете видеть на экране.
                     </p>
                     <p style="color: red">
                        <b>ВНИМАНИЕ! После окончания каждой партии зафиксируйте Ваш выигрыш и выигрыш Игрока 2 в отчете.<br>
                        После окончания игры напишите самоотчет по игре в целом, в котором дайте характеристику вашей игре и игре противника - Игрока 2.
                     </p>
                     <p>
                        <b>Если Вы готовы начать игру, то нажмите кнопку "Начать игру"
                     </p>
                 """
                   }
game_mode = {0: "Игра в 2-х партиях с одним и тем же Игроком 2, которого выбирает компьютер",
             1: "Играть вторую партию с игроком АА",
             2: "Играть вторую партию с игроком BB"}
